{
    "Agility": "An agility weapon gives its wielder a +2, +4, or +6 resistance bonus on all Reflex saving throws made while holding the weapon.",
    "Bane": "A bane weapon excels at attacking one type of creature. Against its designated foe, its effective enhancement bonus is +2 better than its normal enhancement bonus (so a +1 longsword is a +3 longsword against its foe). Further, it deals +2d6 points of bonus damage against the foe.",
    "Dancing": "A dancing weapon can be loosed (requiring a standard action) to attack on its own. It fights for 4 rounds using the base attack bonus of the one who loosed it and then drops. It never leaves the side of the one who loosed it (never straying more than 5 feet) and fights on even if that creature falls. The wielder who loosed it can grasp it while it is attacking on its own as a free action, but when so retrieved it can't dance (attack on its own) again for 4 rounds.",
    "Defending": "A defender weapon allows the wielder to transfer some or all of the sword's enhancement bonus to his AC as a special bonus that stacks with all others. As a free action, the wielder chooses how to allocate the weapon's enhancement bonus at the start of his turn before using the weapon, and the effect to AC lasts until his next turn.",
    "Disruption": "A weapon of disruption is the bane of all undead. Any undead creature struck in combat must succeed at a Fortitude save (DC 14) or be destroyed. A weapon of disruption must be a bludgeoning weapon.",
    "Everdancing": "An everdancing weapon is much like a dancing weapon, though it can be loosed with a free action and will fight as long as desired. It can move up to 60 feet away from its owner. Its owner can instruct it to move to a different target as a move-equivalent action. If its owner is rendered unconscious or otherwise unable to direct it, it will fight the same opponent as long as that opponent is conscious and within range. The owner of an everdancing weapon can grasp it again as a free action (assuming it is within reach).",
    "Flaming": "Upon command, a flaming weapon is sheathed in fire. The fire does not harm the hands that hold the weapon. Flaming weapons deal +1d6 points of bonus fire damage on a successful hit. Bows, crossbows, and slings so enchanted bestow the fire energy upon their ammunition.",
    "FlamingBurst": "A flaming burst weapon functions as a flaming weapon that also explodes with flame upon striking a successful critical hit. The fire does not harm the hands that hold the weapon. Flaming burst weapons deal +1d10 points of bonus fire damage on a successful critical hit. If the weapon's critical multiplier is x3, add +2d10 points of bonus fire damage instead, and if the multiplier is x4, add +3d10 points of bonus fire damage. Bows, crossbows, and slings so enchanted bestow the fire energy upon their ammunition.",
    "Flying": "A flying weapon can fly at speed 30 feet and is treated as an animated object with hardness and hit points equal to a typical weapon of its kind. A flying weapon follows orders subject to the limits of its ability (it has no Intelligence) but can be ordered to guard a location just as an animated skeleton can. Only melee weapons can have the flying ability.",
    "Frost": "Upon command, a frost weapon is sheathed in icy cold. The cold does not harm the hands that hold the weapon. Frost weapons deal +1d6 points of bonus cold damage on a successful hit. Bows, crossbows, and slings so enchanted bestow the cold energy upon their ammunition.",
    "GhostTouch": "This armor or shield seems almost translucent. Both its enhancement bonus and its armor bonus count against the attacks of incorporeal creatures. Further, it can be picked up, moved, and worn by incorporeal creatures at any time. Incorporeal creatures gain the armor or shield's enhancement bonus against both corporeal and incorporeal attacks, and they can still pass freely through solid objects.",
    "IcyBurst": "An icy burst weapon functions as a frost weapon that also explodes with frost upon striking a successful critical hit. The frost does not harm the hands that hold the weapon. Icy burst weapons deal +1d10 points of bonus cold damage on a successful critical hit. If the weapon's critical multiplier is x3, add +2d10 points of bonus cold damage instead, and if the multiplier is x4, add +3d10 points of bonus cold damage. Bows, crossbows, and slings so enchanted bestow the cold energy upon their ammunition.",
    "Initiative": "An initiative weapon gives its bearer a +2 luck bonus on initiative checks made while carrying the weapon.",
    "Passage": "Once per day, a passage weapon can slice open a portal into the Spirit World. This works as the plane shift spell, but creates a portal that remains open for 1d4 minutes and then closes. Any creature can pass through the portal, in either direction, while it is open, but once it closes it cannot be opened again.",
    "Sizing": "The wielder of a sizing weapon can change its size category as a standard action. For example, a Small short sword can be changed into a Large short sword. Spellcasters who polymorph themselves frequently tend to appreciate weapons with the sizing property.",
    "Souldrinking": "This melee weapon bestows one negative level each time it deals damage normally. When the wielder scores a critical hit with the weapon, it bestows two negative levels, and the wielder gains +1d8 temporary hit points and a +2 enhancement bonus to Strength. The temporary hit points and enhancement bonus fade after 1 hour.",
    "Speed": "A weapon of speed allows the wielder one single extra attack each round at his highest bonus. It is not cumulative with haste. The extra attack must be with this weapon, not with some other weapon. The weapon does not grant the benefits of a haste spell, so an additional partial action is not what is granted, simply an extra single attack with this weapon.",
    "Spellblade": "The wielder of a spellblade weapon is immune to a single spell chosen at the time the weapon is created. The selected spell must be one that is targeted against the wielder, not one that affects an area or creates an effect. When the wielder is next subjected to the chosen spell, the weapon absorbs it. On his next turn, he can opt to either let the spell drain harmlessly away or direct it at a new target as a free action.",
    "Spellstrike": "A spellstrike weapon allows the wielder to transfer some or all of the weapon's enhancement bonus as a bonus on his saving throws against spells and spell-like abilities. As a free action, the wielder chooses how to allocate the weapon's enhancement bonus at the start of his turn before using the weapon, and the effect on saving throws lasts until his next turn. This bonus stacks with all other bonuses that benefit the wielder's saving throws.",
    "Shock": "Upon command, a shock weapon is sheathed in crackling electricity. The electricity does not harm the hands that hold the weapon. Shock weapons deal +1d6 points of bonus electricity damage on a successful hit. Bows, crossbows, and slings so enchanted bestow the electricity energy upon their ammunition.",
    "ShockingBurst": "A shocking burst weapon functions as a shock weapon that also explodes with electricity upon striking a successful critical hit. The electricity does not harm the hands that hold the weapon. Shocking burst weapons deal +1d10 points of bonus electricity damage on a successful critical hit. If the weapon's critical multiplier is x3, add +2d10 points of bonus electricity damage instead, and if the multiplier is x4, add +3d10 points of bonus electricity damage. Bows, crossbows, and slings so enchanted bestow ,the electricity energy upon their ammunition.",
    "Thundering": "A thundering weapon creates a cacophonous roar like thunder upon striking a successful critical hit. The sonic energy does not harm the wielder of the weapon. Thundering weapons deal +1d8 points of bonus sonic damage on a successful critical hit. If the weapon's critical multiplier is x3, add +2d8 points of bonus sonic damage instead, and if the multiplier is x4, add +3d8 points of bonus sonic damage. Bows, crossbows, and slings so enchanted bestow the sonic energy upon their ammunition. Subjects dealt a critical hit by a thundering weapon must make a Fortitude save (DC 14) or be deafened permanently.",
    "Wounding": "A weapon of wounding deals damage to a creature such that a wound it inflicts bleeds for 1 point of damage per round thereafter in addition to the normal damage the weapon deals. Multiple wounds from the weapon result in cumulative bleeding loss (two wounds for 2 points of damage per round, and so on). The bleeding can only be stopped by a successful Heal check (DC 15) or the application of any cure spell or other healing spell (heal, healing circle, and so on)."
}